warbler12/FOC_Motor_Control/mcb/HallOffsetExample/mcb_pmsm_hall_offset_f28069m_ert_rtw/mcb_pmsm_hall_offset_f28069m.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  uint64m_T Add1_DWORK1;               /* '<S99>/Add1' */
  real32_T UnitDelay_DSTATE;           /* '<S102>/Unit Delay' */
  real32_T Delay_DSTATE;               /* '<S101>/Delay' */
  real32_T Delay_DSTATE_p;             /* '<S80>/Delay' */
  real32_T UnitDelay_DSTATE_f;         /* '<S92>/Unit Delay' */
  uint32_T Delay_DSTATE_pm;            /* '<S99>/Delay' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S5>/Digital Output' */
  int32_T DigitalOutput_FRAC_LEN_a;    /* '<S77>/Digital Output' */
  uint32_T GlobalSpeedCount;           /* '<Root>/Data Store Memory1' */
  uint32_T GlobalHallState;            /* '<Root>/Data Store Memory4' */
  uint32_T Sum_DWORK1[4];              /* '<S83>/Sum' */
  uint16_T DelayOneStep_DSTATE;        /* '<S128>/Delay One Step' */
  uint16_T Output_DSTATE;              /* '<S117>/Output' */
  int16_T GlobalDirection;             /* '<Root>/Data Store Memory3' */
  uint16_T HallStateChangeFlag;        /* '<Root>/Data Store Memory' */
  uint16_T GlobalSpeedValidity;        /* '<Root>/Data Store Memory2' */
  uint16_T Add_DWORK1;                 /* '<S122>/Add' */
  boolean_T DelayOneStep1_DSTATE;      /* '<S128>/Delay One Step1' */
  boolean_T Delay_DSTATE_b;            /* '<S103>/Delay' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T PosGen_MODE;               /* '<S74>/PosGen' */
  boolean_T UpCounter_MODE;            /* '<S82>/Up Counter' */
  boolean_T FindOffset_MODE;           /* '<S74>/Find Offset' */
} D_Work_mcb_pmsm_hall_offset_f28;

/* Constant parameters (default storage) */
typedef struct {
  /* Computed Parameter: sine_table_values_Value
   * Referenced by: '<S83>/sine_table_values'
   */
  real32_T sine_table_values_Value[1002];
} ConstParam_mcb_pmsm_hall_offset;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_hall_offset_f2 {
  const char_T * volatile errorStatus;
};

/* Block signals (default storage) */
extern BlockIO_mcb_pmsm_hall_offset_f2 mcb_pmsm_hall_offset_f28069m_B;

/* Block states (default storage) */
extern D_Work_mcb_pmsm_hall_offset_f28 mcb_pmsm_hall_offset_f280_DWork;

/* Constant parameters (default storage) */
extern const ConstParam_mcb_pmsm_hall_offset mcb_pmsm_hall_offset_f28_ConstP;

/* Model entry point functions */
extern void mcb_pmsm_hall_offset_f28069m_initialize(void);
extern void mcb_pmsm_hall_offset_f28069m_step(void);
extern void mcb_pmsm_hall_offset_f28069m_terminate(void);

/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_hall_offset_f *const mcb_pmsm_hall_offset_f28069m_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  interrupt void ECAP1_INT(void);
  interrupt void ECAP2_INT(void);
  interrupt void ECAP3_INT(void);
  interrupt void SCIRXINTA(void);
  void mcb_pmsm_hall_offset_f28069m_configure_interrupts (void);
  void mcb_pmsm_hall_offset_f28069m_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_hall_offset_f28069m'
 * '<S1>'   : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt'
 * '<S2>'   : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A'
 * '<S3>'   : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B'
 * '<S4>'   : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C'
 * '<S5>'   : 'mcb_pmsm_hall_offset_f28069m/Heartbeat LED'
 * '<S6>'   : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation'
 * '<S7>'   : 'mcb_pmsm_hall_offset_f28069m/Serial Receive'
 * '<S8>'   : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ADCINT1'
 * '<S9>'   : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP1_INT'
 * '<S10>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP2_INT'
 * '<S11>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP3_INT'
 * '<S12>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_SCIRXINTA'
 * '<S13>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ADCINT1/ECSoC'
 * '<S14>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ADCINT1/ECSoC/ECSimCodegen'
 * '<S15>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP1_INT/ECSoC'
 * '<S16>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP1_INT/ECSoC/ECSimCodegen'
 * '<S17>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP2_INT/ECSoC'
 * '<S18>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP2_INT/ECSoC/ECSimCodegen'
 * '<S19>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP3_INT/ECSoC'
 * '<S20>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_ECAP3_INT/ECSoC/ECSimCodegen'
 * '<S21>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_SCIRXINTA/ECSoC'
 * '<S22>'  : 'mcb_pmsm_hall_offset_f28069m/HW Interrupt/HWI_SCIRXINTA/ECSoC/ECSimCodegen'
 * '<S23>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Capture Event Selection'
 * '<S24>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity'
 * '<S25>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Capture Event Selection/Output 0'
 * '<S26>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Capture Event Selection/Output 1'
 * '<S27>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem'
 * '<S28>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Bad hall (glitch or wrong connection)'
 * '<S29>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls'
 * '<S30>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem'
 * '<S31>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem1'
 * '<S32>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem2'
 * '<S33>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem3'
 * '<S34>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem4'
 * '<S35>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem5'
 * '<S36>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem6'
 * '<S37>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem7'
 * '<S38>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/If Action Subsystem8'
 * '<S39>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor A/Hall Validity/Subsystem/Valid Halls/Switch Case Action Subsystem'
 * '<S40>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Capture Event Selection'
 * '<S41>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity'
 * '<S42>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Capture Event Selection/Output 0'
 * '<S43>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Capture Event Selection/Output 1'
 * '<S44>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem'
 * '<S45>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Bad hall (glitch or wrong connection)'
 * '<S46>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls'
 * '<S47>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem'
 * '<S48>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem1'
 * '<S49>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem2'
 * '<S50>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem3'
 * '<S51>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem4'
 * '<S52>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem5'
 * '<S53>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem6'
 * '<S54>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem7'
 * '<S55>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/If Action Subsystem8'
 * '<S56>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor B/Hall Validity/Subsystem/Valid Halls/Switch Case Action Subsystem'
 * '<S57>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Capture Event Selection'
 * '<S58>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity'
 * '<S59>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Capture Event Selection/Output 0'
 * '<S60>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Capture Event Selection/Output 1'
 * '<S61>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem'
 * '<S62>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Bad hall (glitch or wrong connection)'
 * '<S63>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls'
 * '<S64>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem'
 * '<S65>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem1'
 * '<S66>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem2'
 * '<S67>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem3'
 * '<S68>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem4'
 * '<S69>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem5'
 * '<S70>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem6'
 * '<S71>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem7'
 * '<S72>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/If Action Subsystem8'
 * '<S73>'  : 'mcb_pmsm_hall_offset_f28069m/Hall Sensor C/Hall Validity/Subsystem/Valid Halls/Switch Case Action Subsystem'
 * '<S74>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System'
 * '<S75>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output'
 * '<S76>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Output Scaling'
 * '<S77>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/PWM_Output'
 * '<S78>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Parameters'
 * '<S79>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem'
 * '<S80>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset'
 * '<S81>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Inverse Park Transform'
 * '<S82>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen'
 * '<S83>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup'
 * '<S84>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator'
 * '<S85>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Subsystem1'
 * '<S86>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Compare To Constant'
 * '<S87>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Compare To Constant1'
 * '<S88>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Subsystem'
 * '<S89>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Subsystem/IIR Filter'
 * '<S90>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Subsystem/IIR Filter/IIR Filter'
 * '<S91>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Subsystem/IIR Filter/IIR Filter/Low-pass'
 * '<S92>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Find Offset/Subsystem/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S93>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Inverse Park Transform/Two inputs CRL'
 * '<S94>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Inverse Park Transform/Two inputs CRL/Switch_Axis'
 * '<S95>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Disable host after 22 seconds'
 * '<S96>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Enable PWM for 20 seconds'
 * '<S97>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem'
 * '<S98>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1'
 * '<S99>'  : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Up Counter'
 * '<S100>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1/If Action Subsystem'
 * '<S101>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1/If Action Subsystem2'
 * '<S102>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1/Position Generator'
 * '<S103>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1/Position Generator/Accumulate'
 * '<S104>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/PosGen/Subsystem1/Position Generator/Accumulate/Subsystem'
 * '<S105>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup/Interpolation'
 * '<S106>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup/WrapUp'
 * '<S107>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S108>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S109>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S110>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Modulation method'
 * '<S111>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Voltage Input'
 * '<S112>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Modulation method/SVPWM'
 * '<S113>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S114>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S115>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S116>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Control_System/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform/Two phase input'
 * '<S117>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Counter Limited'
 * '<S118>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Data'
 * '<S119>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Data_Conditioning'
 * '<S120>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/End'
 * '<S121>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Start'
 * '<S122>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/While Iterator Subsystem'
 * '<S123>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Counter Limited/Increment Real World'
 * '<S124>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Data Serial Output/Counter Limited/Wrap To Zero'
 * '<S125>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall'
 * '<S126>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position'
 * '<S127>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/ExtrapolationOrder'
 * '<S128>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Software Watchdog Timer'
 * '<S129>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant'
 * '<S130>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position'
 * '<S131>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/VaidityCheck'
 * '<S132>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Software Watchdog Timer/Compare To Zero'
 * '<S133>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction'
 * '<S134>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 1'
 * '<S135>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 2'
 * '<S136>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 3'
 * '<S137>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 4'
 * '<S138>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 5'
 * '<S139>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 6'
 * '<S140>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 7'
 * '<S141>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/If Action Subsystem'
 * '<S142>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/If Action Subsystem1'
 * '<S143>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1'
 * '<S144>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction'
 * '<S145>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction'
 * '<S146>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/first_order'
 * '<S147>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/second_order'
 * '<S148>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 1'
 * '<S149>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 2'
 * '<S150>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 3'
 * '<S151>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 4'
 * '<S152>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 5'
 * '<S153>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 6'
 * '<S154>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 7'
 * '<S155>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 1'
 * '<S156>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 2'
 * '<S157>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 3'
 * '<S158>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 4'
 * '<S159>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 5'
 * '<S160>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 6'
 * '<S161>' : 'mcb_pmsm_hall_offset_f28069m/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 7'
 * '<S162>' : 'mcb_pmsm_hall_offset_f28069m/Serial Receive/Data_Conditioning'
 */
#endif                          /* RTW_HEADER_mcb_pmsm_hall_offset_f28069m_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
